import pygame
from pygame.draw import *

pygame.init()

FPS = 30
screen = pygame.display.set_mode((1200, 700))

# Фоновая заливка 
rect(screen, (245, 222, 179), (0, 0, 1200, 700)) # Основ фон
polygon(screen, (255, 206, 200), [(0, 175), (1200, 200), # Розов
(1200, 360), (0, 310)]) 
rect(screen, (216, 191, 216), (0, 520, 1200, 250)) # Фиолет


# Верхняя левая гора 
polygon(screen, (255, 140, 0), [(10, 360), (20, 320),
	            (200, 262), (280, 160), (310, 170),
	            (320, 190), (480, 300), (570, 290),
	            (600, 310)])

# Верхняя правая гора
polygon(screen, (255, 140, 0), [(600, 310), (648, 260), (690, 270),
				(720, 255), (900, 160), (960, 230), (1000, 215), 
				(1050, 245), (1115, 220), (1200, 259)])
circle(screen, (255, 206, 200), (750, 140), (120)) # Роз круг
polygon(screen, (245, 222, 179), [(620, 0,), # Закраш роз круг
 		(870, 0), (870, 193), (620, 188)]) 
ellipse(screen, (255, 140, 0), (855, 150, 65, 100))


# Нижная гора 
polygon(screen, (139, 0, 0), [(0, 380), (15, 375), (65, 425), 
		(240, 435), (265,505), (300, 400), (370, 450), (395, 360),
		(500, 375), (570, 435), (680, 415), (800, 360), (920, 430), 
		(970, 390), (1020, 415), (1055, 375), (1120, 390), (1200, 310),
		(1200, 520), (0, 520)])
ellipse(screen, (139, 0, 0), (680, 340, 250, 300)) # Закруг верш правая
circle(screen, (245, 222, 179), (908, 392), (40))
polygon(screen, (245, 222, 179), [(840, 345), (875, 415), (940, 370)])
ellipse(screen, (139, 0, 0), (50, 320, 225, 350)) # Закруг верш левая
rect(screen, (216, 191, 216), (0, 520, 1200, 250)) # Закраш фиолет
'''polygon(screen, (255, 206, 200), [(850, 348),      # Закраш роз
		(1080, 355), (1080, 280), (850, 280)])'''





circle(screen, (255, 215, 0), (600, 170), 60) # Солнце

pygame.display.update()
clock = pygame.time.Clock()
finished = False

while not finished:
    clock.tick(FPS)
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            finished = True

pygame.quit()